name: "Smallnets"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 8 dim: 227 dim: 227 } }
}


layer {
  name: "conv1-sn"
  type: "Convolution"
  bottom: "data"
  top: "conv1-sn"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu1-sn"
  type: "ReLU"
  bottom: "conv1-sn"
  top: "conv1-sn"
}

layer {
  name: "pool1-sn"
  type: "Pooling"
  bottom: "conv1-sn"
  top: "pool1-sn"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2-sn"
  type: "Convolution"
  bottom: "pool1-sn"
  top: "conv2-sn"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
  }
}

layer {
  name: "relu2-sn"
  type: "ReLU"
  bottom: "conv2-sn"
  top: "conv2-sn"
}

layer {
  name: "pool2-sn"
  type: "Pooling"
  bottom: "conv2-sn"
  top: "pool2-sn"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3-sn"
  type: "Convolution"
  bottom: "pool2-sn"
  top: "conv3-sn"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
  }
}

layer {
  name: "relu3-sn"
  type: "ReLU"
  bottom: "conv3-sn"
  top: "conv3-sn"
}


layer {
  name: "pool4-sn"
  type: "Pooling"
  bottom: "conv3-sn"
  top: "pool4-sn"
  pooling_param {
    pool: AVE
    kernel_size: 28
    stride: 1
  }
}

layer {
  name: "fc5-sn"
  type: "InnerProduct"
  bottom: "pool4-sn"
  top: "fc5-sn"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
  }
}

layer {
  name: "relu5-sn"
  type: "ReLU"
  bottom: "fc5-sn"
  top: "fc5-sn"
}

layer {
  name: "drop5-sn"
  type: "Dropout"
  bottom: "fc5-sn"
  top: "fc5-sn"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc6-sn"
  type: "InnerProduct"
  bottom: "fc5-sn"
  top: "fc6-sn"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 11
  }
}


layer {
  name: "prob"
  type: "Softmax"
  bottom: "fc6-sn"
  top: "prob"
}

